[
    {
        "name": "RaymondTalk",
        "trigger": "on_talk",
        "level_nid": "0",
        "condition": "unit2.nid == \"Raymond\"",
        "commands": [],
        "only_once": true,
        "priority": 20,
        "_source": [
            "add_portrait;Raymond;MidRight",
            "add_portrait;Simon;MidLeft",
            "s;Raymond;Simon, let's talk.",
            "add_portrait;Alina;FarLeft",
            "add_portrait;Mitzi;FarRight",
            "s;Mitzi;I've spent some time researching in Morrissey's castle.",
            "s;Alina;And I reached out to some of my old professors.|Or the... one who still talks to me.",
            "s;Raymond;Tell him.",
            "s;Mitzi;It's possible for you two to free yourselves from the Fates' grasp.",
            "s;Alina;Possible.",
            "s;Raymond;It's in the shrines, right?",
            "s;Mitzi;Yes. Each god has an artifact that binds them to this world.|If you destroy the artifact, you destroy that bond.",
            "s;Alina;And that will... probably... free you.",
            "s;Simon;Probably?",
            "s;Alina;According to my professor, it'll do other things too.|Those things have so much power, there's no telling what could happen.",
            "s;Simon;This seems risky.{w} Raymond, I know you hate her, but are you sure?",
            "s;Raymond;I'm damn well sure.{w} It's about if you're willing to do it, Simon.|Trust me, one day you'll realize- you don't want those fiends' attention.|They've got a plan for you, and you want out.",
            "s;Simon;But surely they have innate protection against us.|Or woven our fate to simply decide to never attack them.",
            "s;Alina;They're... I can't believe I'm saying this,|but they're just gods, Simon.|And not close to the only ones.",
            "s;Raymond;For them to survive, they need people like you to believe they're untouchable.|The moment people like us fight back, they lose.",
            "s;Simon;I... need some time to think.",
            "s;Mitzi;A sensible approach.{w} Even if they do exaggerate their power,|we musn't attack them lightly.",
            "s;Raymond;True that. Once we destroy one's artifact, things will...|start to change. There's no way they'd let us get away with that.",
            "s;Simon;What do you mean?",
            "s;Raymond;There's no room for a half-finished job here.|We attack one shrine, we need to attack them all.",
            "s;Simon;This is all too much.",
            "s;Alina;Like you said, think it over.|But if you do head to the shrines, we'll be ready.",
            "multi_remove_portrait;Alina;Mitzi;Raymond",
            "remove_talk;Simon;Raymond",
            "",
            "game_var;ShrineBattlesAvailable;True",
            "game_var;PortHullDefyTalk;False"
        ]
    }
]