[
    {
        "name": "Talk Titus",
        "trigger": "on_talk",
        "level_nid": "28",
        "condition": "unit2.nid=='Titus'",
        "commands": [],
        "only_once": true,
        "priority": 20,
        "_source": [
            "multi_add_portrait;Simon;Left;Titus;Right",
            "s;Simon;So Titus, what brings the Wandering Knights here of all places?{w}{br}Why so interested in Vesner's corpse?",
            "s;Titus;To be honest, it's the only thing we could all settle on.",
            "s;Titus;Being part of the knights has been... {w}frustrating lately.{w}{br}So much arguing that it's hard to get anything done!",
            "s;Titus;But we could all agree that Vesner's old lands needed to be cleaned up.{w}{br}The monsters could eventually creep into surrounding villages,{w}{br}perhaps even as far south as Morrissey's lands.",
            "s;Simon;Funny you should mention that.{w}{br}We're working with Morrissey now, actually.",
            "s;Titus;Really? How's working with him been?{w}{br}Haven't heard much, but you need to be a real ruthless bastard to control that much land nowadays.",
            "s;Simon;He's been helpful. He'll likely aid us in restoring House Verstadt.",
            "s;Titus;By the Fates! Are you the new lord of House Verstadt?{w}{br}I knew you looked familiar!",
            "s;Simon;Yeah, I'm Bertholdt Verstadt's son, Simon.",
            "s;Titus;Well, Simon, back when I was a captain for House Charin, I met your old man a few times.",
            "s;Titus;And,{w} well,{w} sorry to hear about what happened.{w}{br}Losing your home hurts.{w}{br}It was the same for me when Lord Charin was overthrown and the loyalists were cast out.",
            "s;Simon;What happened? {w}That was all a bit before my time.",
            "s;Titus;Well, some subjects were clamoring for a say in how things were run.{w}{br}Naturally, Charin wanted that nonsense quashed immediately.",
            "s;Titus;But we... {w}underestimated how much support their movement had.{w}{br}We put up a good fight, but we were outnumbered.",
            "s;Titus;Charin was done for.",
            "wait;300",
            "s;Titus;I only wish we had someone like Morrisey to help us out back then.",
            "s;Simon;I'm sorry to hear that, Titus.",
            "s;Titus;All you can do is move forward.{w}{br}And hey, if you need help restoring your house, I'm all in.",
            "s;Titus;The noble houses are really the only way to keep this crumbling world in order.",
            "s;Simon;We'll be glad to have your help.",
            "multi_remove_portrait;Simon;Titus",
            "remove_talk;Simon;Titus"
        ]
    }
]