[
    {
        "name": "AtroposEnding",
        "trigger": null,
        "level_nid": "49",
        "condition": "True",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "music;SilverGarden",
            "change_background;BlackBackground",
            "wait;2000",
            "credits;A Game By;SP,KD;wait;center",
            "wait;6000",
            "",
            "ending;Simon;Simon;With his mind broken, nothing stood between the noble houses and complete chaos. Rebel groups quickly overwhelmed the remains of the nobles' armies, and established new governments across the realm. Simon, when captured, was kept alive. He was, after all, no threat to anyone.",
            "wait;10000",
            "pop_dialog",
            "",
            "ending;Anuki;Anuki;Anuki initially refused to accept the truth of Simon's situation. Stubborn and bull-headed, she attempted to govern both Verstadt and Morrissey lands until she was killed in a carriage ambush by rebels. What remained of Morrissey territory collapsed without her.",
            "wait;10000",
            "pop_dialog",
            "",
            "credits;Engine By;rainlash,mag,KD,aorlnn;wait;center",
            "wait;6000",
            "",
            "ending;Luther;Luther;Luther worked tirelessly to protect Simon and uphold the reign of the Verstadts. Yet his efforts were for naught, and the nobility collapsed soon after Simon's injury. Though he is said to have fallen in the second battle for Castle Verstadt, his body was never identified.",
            "wait;8000",
            "pop_dialog",
            "",
            "paired_ending;Juliet;Vincent;Juliet;Vincent;Vincent and Juliet journeyed west in search of a cure for Simon's condition. Though one was eventually found, they returned too late, with their home destroyed and themselves named as traitors.",
            "wait;8000",
            "pop_dialog",
            "",
            "credits;World Map By;BT;wait;center",
            "wait;6000",
            "",
            "if;game.check_alive(\"Boudica\")",
            "ending;Boudica;Boudica;Recognizing the writing on the wall, Boudica returned to her village. Rebuilt and repopulated by refugees, the turmoil that swept the continent passed the tiny hamlet by.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Kajal\") and game.get_unit(\"Kajal\").team == 'player'",
            "ending;Kajal;Kajal;Leaving Simon's retinue, Kajal sought to build a magocracy in the ruins of Vesner's land. Though few survived the journey to his new lands, rumors of his power began to amass a dark cult of followers, each fiercely loyal to their new lord.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Mitzi\")",
            "ending;Mitzi;Mitzi;Concluding on a hopeless note, Mitzi ultimately never published the works she had written. Consigned to a forgotten role as a Pelopos court scribe, history never had the chance to remember the one who had been so desperate to write of it.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Nika\")",
            "ending;Nika;Nika;Sensing the oncoming conflicts, Nika returned to Frees and did her best to protect it. Ultimately it came to naught, as its position along the Morrissey-Port Hull road made it too valuable for bandits to leave alone. She is presumed to have fallen along with the rest of her village.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Tilesets By;Feaw,N426,ZoramineFae,Venno,Lexou,Amras Anarion,Thunungu,aveontrainer,Inkaline, Redshrike,dracoyan,magiscarf;wait;center",
            "wait;6000",
            "",
            "if;game.check_alive(\"Flower\")",
            "ending;Flower;Flower;Abandoned and confused, Flower attempted to make her way back to Frees village. After wandering away from Castle Verstadt, she was never seen again.",
            "wait;6000",
            "pop_dialog",
            "end",
            "",
            "ending;MaYuan;Ma Yuan;Ma Yuan ceased to function soon after Morrissey's betrayal. Though attempts were made to study its inner workings, the rebellions made serious research impossible. It was, alongside the ruins it flew from, eventually consigned to dust.",
            "wait;10000",
            "pop_dialog",
            "",
            "if;game.check_alive(\"Twins\") and game.get_unit(\"Twins\").team == 'player'",
            "ending;Twins;The Twins;The Twins were aware of Simon's condition, and knew the end of the Verstadts was close at hand. They were caught while attempting to desert, and hanged as a warning to the other troops.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Johannes\")",
            "ending;Johannes;Johannes;The fall of House Verstadt affected Johannes little. He continued on his way, slaying whatever beasts he could find to challenge him. History lost track of him soon afterwards, and there are no further accounts of his travels.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Item Icons By;Ironmachine,Topazlight,Beansy,Maxim,Lisandra Brave,Pikmin1211,WhydidImakethisaccount,Zelix,LordGlenn,Celice,Batima,Suneohair,FuriousHaunter,GabrielKnight;center",
            "wait;8000",
            "",
            "if;game.check_alive(\"Euclid\") and game.get_unit(\"Euclid\").team == 'player'",
            "ending;Euclid;Euclid;Sensing an opportunity to spread civilization, Euclid was commissioned by the Pelopos senate to seize a portion of Morrissey's land. This military victory earned him a senate seat, though he rarely seemed interested in his work.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Yusna\")",
            "ending;Yusna;Yusna;Hoping to find an end to the chaos, Yusna returned to Port Hull. But the instability spread throughout the continent ruined the trade economy of the once-prosperous city. It became a ghost town, and Yusna was left to wander within the sea of refugees spread throughout the continent.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Lysander\") and game.get_unit(\"Lysander\").team == 'player'",
            "ending;Lysander;Lysander;Unperturbed, Lysander returned to the arena at Pelopos. Though many traveling adventurers and warbands attempted to recruit him, he is said to have never again left the city. ",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Map Sprites By;Suloir,Teraspark,Primefusion,ArcherBias,ZeroXA,Alusq,Epicer,N426,ShadowAllyX,Leif,MeatofJustice,Rasdel,ArcaneEli,Pikmin,L95,Der,Skitty,Devisian Nights,Fe7if,Boonzeet,Dei,Dondon151,Ririk,Catinator,Alexsplode,Dominus_Vobiscum,Snewping,Pushwall,Argo,Flasuban,ArcherBias,EldrichAbomination,knabepiercer,NightBloodTK,SALVAGED,BoneMan,Seth,VelvetKitsune,CanDy,Leo_link;center",
            "wait;10000",
            "",
            "if;game.check_alive(\"Alina\")",
            "ending;Alina;Alina;Alina traveled west to Troy, and finding nothing but devastation there traveled westward still. She brought with her tales of a barren and war-torn land, and kept its soon-to-be lost culture and traditions alive.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Melodie\") and game.get_unit(\"Melodie\").team == 'player'",
            "ending;Melodie;Melodie;Having seen the chaos that she had expected of the civilized world, Melodie peacefully returned to her tribe. She was eventually made its chieftain, and expanded their hunting grounds into the territory of what had once been Verstadt and Port Hull.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Hatshepsut\") and game.get_unit(\"Hatshepsut\").team == 'player'",
            "ending;Hatshepsut;Hatshepsut;Though Hatshepsut pitied Simon, she knew there was nothing she could do to help him. She continued her travels, moving west and aiding countless more adventurers in their journeys.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Portraits By;Wasdye,amema003,CanDy,Armory,CapibaraInSpace,Eldritch Abomination,Freefall,Kanna,bwan,Obsidian Daddy,LaurentLacroix,Tom776,Zeldacrafter,Imperial,Its Just Jay,Levin64,XVI,Citrus,JiroPaiPai,Rammerrush,DATonDeman,Sterling Glover,SphealNuke,Salty,Sgt Dark,SirNicee,XPGamesNL,Ambrosiac,L95,Smokeguy77,RandomWizard,Yang Kai,Matthieu,XPGamesNL,Dutch Introvert,Alice;center",
            "wait;15000",
            "",
            "if;game.check_alive(\"Duygu\")",
            "ending;Duygu;Duygu;Disappointed by Simon's failure, Duygu continued on his journey. He sought ever greater opponents, and was eventually said to have been killed in a landslide to the north of Troy. Only the earth itself could bury him.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Raymond\") and game.get_unit(\"Raymond\").team == 'player'",
            "ending;Raymond;Raymond;Without Simon and his allies, Raymond had little hope of killing Lachesis and freeing himself from her curse. Though he spent the rest of his life trying, he was killed in an unfortunate accident only a few years after Morrissey's defeat.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"LadyJane\") and game.get_unit(\"LadyJane\").team == 'player'",
            "ending;LadyJane;Lady Jane;Jane seized the moment, and took control of a few villages to the southwest of Castle Verstadt. Yet, despite her power, the people prevailed, and slew her within a few months.  Though some of her subjects live on, the sorceress herself was quickly forgotten.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "credits;Maps By;SP,KD,Rammerrush;wait;center",
            "wait;6000",
            "",
            "if;game.check_alive(\"Lupus\") and game.get_unit(\"Lupus\").team == 'player'",
            "ending;Lupus;Lupus;After learning of Simon's condition Lupus split, preferring to leave that part of his life behind. There are no official accounts of his work after the defeat of Morrissey, though it's certain that he emptied more than a few storehouses.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Lim\")",
            "ending;Lim;Lim;Desperate for the power to save Frees, Lim returned to Thanatos's lair. She was never heard from again.",
            "wait;4000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Titus\") and game.get_unit(\"Titus\").team == 'player'",
            "ending;Titus;Titus;Titus returned to the Wandering Knights, continuing to seek out noble causes wherever they lay. Though the movements of the company itself are well documented, Titus's actions fade from history.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Playtesting By;HeroicVileplume,EthanGreen,;wait;center",
            "wait;6000",
            "",
            "wait;5000",
            "",
            "speak_style;IntroQuote;Narrator;center;190;4.0;White;chapter-white;None;5;f;None;0.0;None",
            "speak;Narrator;Nobility is the badge of lost innocence. Their palaces are built on the ruins of the bowers of paradise.;StyleNid=IntroQuote;no_block;hold;no_sound",
            "wait;7000",
            "unhold;IntroQuote",
            "",
            "speak;Narrator;So wove Atropos, sister of the Fates.;StyleNid=IntroQuote;no_block;hold;no_sound",
            "music_clear;6000",
            "wait;7000",
            "unhold;IntroQuote",
            "",
            "wait;4000",
            "main_menu"
        ]
    }
]