[
    {
        "name": "ClothoEnding",
        "trigger": null,
        "level_nid": "49",
        "condition": "True",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "music;Zanarkand;1000",
            "",
            "change_background;BlackBackground",
            "wait;2000",
            "credits;A Game By;SP,KD;wait;center",
            "wait;6000",
            "",
            "ending;Simon;Simon;{tgs}Simon and his companions left the realm behind, preferring a life of solitude and safety over the turmoil of conflict. With no stable noble houses remaining, rebellions sprung up across the continent, establishing new forms of government throughout the realm.",
            "wait;10000",
            "pop_dialog",
            "",
            "if;game.get_unit(\"Anuki\").team == \"player\"",
            "",
            "ending;Anuki;Anuki;{tgs}Anuki joined Simon in his voyage away from the realm. Though she initially objected to giving up her titles, she eventually relented. It's hard to know if she ever truly found peace with being a no-one in a strange land, but, over time, she grew content.",
            "wait;10000",
            "pop_dialog",
            "",
            "else",
            "",
            "ending;Anuki;Anuki;{tgs}Anuki's dynasty was buried with her. While her father's remaining advisors remembered her as loyal until the end, few remember her at all.",
            "wait;4000",
            "pop_dialog",
            "",
            "end",
            "",
            "if;game.check_alive(\"Hatshepsut\") and game.get_unit(\"Hatshepsut\").team == 'player'",
            "ending;Hatshepsut;Hatshepsut;{tgs}Despite having set Simon on his path away from power, Hatshepsut declined to join him. Her old home held too many memories, and she was certain that she would be unwelcome there anyways. She continued to travel west, aiding the many adventurers she encountered in her journey.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Engine By;rainlash,mag,KD,aorlnn;wait;center",
            "wait;6000",
            "",
            "ending;Luther;Luther;{tgs}Luther boarded the ship with Simon, ready to finally find peace in a new world. He lived a long life, and it is said that he died some time later in this distant land. He was cared for by Simon, Vincent, and Juliet until his last breath.",
            "wait;8000",
            "pop_dialog",
            "",
            "paired_ending;Juliet;Vincent;Juliet;Vincent;{tgs}Vincent and Juliet absconded with their companions away from the continent. Vincent proposed to Juliet during the journey, and the two were happily married once they made land in their new home.",
            "wait;8000",
            "pop_dialog",
            "",
            "credits;World Map By;BT;wait;center",
            "wait;6000",
            "",
            "credits;Music By;Drew Portinga;wait;center",
            "wait;6000",
            "",
            "if;game.check_alive(\"Boudica\")",
            "ending;Boudica;Boudica;{tgs}Though many left with Simon, Boudica could not stand to leave her home behind. She returned to her village and began to rebuild, though the chaos created by the power vacuum undid her progress and, eventually, took her life.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Kajal\") and game.get_unit(\"Kajal\").team == 'player'",
            "ending;Kajal;Kajal;{tgs}Leaving Simon's retinue, Kajal sought to build a magocracy in the ruins of Vesner's land. Though few survived the journey to his new lands, rumors of his power began to amass a dark cult of followers, each fiercely loyal to their new lord.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Mitzi\")",
            "ending;Mitzi;Mitzi;{tgs}Excited to bring her knowledge to an entirely new audience, Mitzi wrote volumes on the voyage to the new land. Once there, however, her work was ridiculed by her new peers. They questioned how someone from such a backwater place could call themselves a historian.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Nika\")",
            "ending;Nika;Nika;{tgs}Nika returned to Frees after the voyage set out, desperate to prepare it for the oncoming storm. Despite all odds, she, and Frees, prevailed. Though raids and wars persisted throughout the rest of her life, Nika passed on knowing that Frees was safe.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Tilesets By;Feaw,N426,ZoramineFae,Venno,Lexou,Amras Anarion,Thunungu,aveontrainer,Inkaline, Redshrike,dracoyan,magiscarf;wait;center",
            "wait;4000",
            "",
            "if;game.check_alive(\"Flower\")",
            "ending;Flower;Flower;{tgs}Despite his best efforts, Simon could not convince Flower to follow him on his voyage. Instead, she returned to Frees village. It is not known what happened to her afterwards.",
            "wait;6000",
            "pop_dialog",
            "end",
            "",
            "ending;MaYuan;Ma Yuan;{tgs}Ma Yuan ceased to function soon after Morrissey's betrayal. Though attempts were made to study its inner workings, the rebellions made serious research impossible. It was, alongside the ruins it flew from, eventually consigned to dust.",
            "wait;10000",
            "pop_dialog",
            "",
            "if;game.check_alive(\"Twins\") and game.get_unit(\"Twins\").team == 'player'",
            "ending;Twins;The Twins;{tgs}The Twins journeyed to the new land as well, and began to explore it just as Hatshepsut had theirs. Every village has a tale of one of their adventures, and most of the people who tell those tales would even consider them heroes.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Johannes\")",
            "ending;Johannes;Johannes;{tgs}Excited to see what challenges a new land could offer, Johannes traveled overseas with Simon. Later writings of his companions indicate that he found more than his fair share of monstrous beasts to overcome.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Item Icons By;Ironmachine,Topazlight,Beansy,Maxim,Lisandra Brave,Pikmin1211,WhydidImakethisaccount,Zelix,LordGlenn,Celice,Batima,Suneohair,FuriousHaunter,GabrielKnight,NeoMasterZX,ZeroXA;center",
            "wait;8000",
            "",
            "if;game.check_alive(\"Euclid\") and game.get_unit(\"Euclid\").team == 'player'",
            "ending;Euclid;Euclid;{tgs}Euclid returned to his studies in Pelopos after the defeat of Morrissey. An outcast after working with Simon, he still volunteered to help defend the city from a rebel siege. Though he fell in that battle, his contraptions and advice was crucial to the city's successful defense.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Yusna\")",
            "ending;Yusna;Yusna;{tgs}Hoping to find an end to the chaos, Yusna returned to Port Hull. But the instability spread throughout the continent ruined the trade economy of the once-prosperous city. It became a ghost town, and Yusna was left to wander within the sea of refugees spread throughout the continent.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Lysander\") and game.get_unit(\"Lysander\").team == 'player'",
            "ending;Lysander;Lysander;{tgs}Unperturbed, Lysander returned to the arena at Pelopos. Though many traveling adventurers and warbands attempted to recruit him, he is said to have never again left the city. When the city later came under siege he is said to have provided invaluable assistance to its defenders.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Map Sprites By;Suloir,Teraspark,Primefusion,ArcherBias,ZeroXA,Alusq,Epicer,N426,ShadowAllyX,Leif,MeatofJustice,Rasdel,ArcaneEli,Pikmin,L95,Der,Skitty,Devisian Nights,Fe7if,Boonzeet,Dei,Dondon151,Ririk,Catinator,Alexsplode,Dominus_Vobiscum,Snewping,Pushwall,Argo,Flasuban,ArcherBias,EldrichAbomination,knabepiercer,NightBloodTK,SALVAGED,BoneMan,Seth,VelvetKitsune,CanDy,Leo_link;center",
            "wait;10000",
            "",
            "if;game.check_alive(\"Alina\")",
            "ending;Alina;Alina;{tgs}Alina traveled west to Troy, and finding nothing but devastation there traveled westward still. She brought with her tales of a barren and war-torn land, and kept its soon-to-be lost culture and traditions alive.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Melodie\") and game.get_unit(\"Melodie\").team == 'player'",
            "ending;Melodie;Melodie;{tgs}Having seen the chaos that she had expected of the civilized world, Melodie peacefully returned to her tribe. She was eventually made its chieftain, and expanded their hunting grounds into the territory of what had once been Port Hull and the Verstadt desmense.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Portraits By;Wasdye,amema003,CanDy,Armory,CapibaraInSpace,Eldritch Abomination,Freefall,Kanna,bwan,Obsidian Daddy,LaurentLacroix,Tom776,Zeldacrafter,Imperial,Its Just Jay,Levin64,XVI,Citrus,JiroPaiPai,Rammerrush,DATonDeman,Sterling Glover,SphealNuke,Salty,Sgt Dark,SirNicee,XPGamesNL,Ambrosiac,L95,Smokeguy77,RandomWizard,Yang Kai,Matthieu,XPGamesNL,Dutch Introvert,Alice,Nickt,LonkfromCalifornia;center",
            "wait;15000",
            "",
            "if;game.check_alive(\"Duygu\")",
            "ending;Duygu;Duygu;{tgs}Disappointed by Simon's failure, Duygu continued on his journey. He sought ever greater opponents, and was eventually said to have been killed in a landslide to the north of Troy. Only the earth itself could bury him.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Raymond\") and game.get_unit(\"Raymond\").team == 'player'",
            "ending;Raymond;Raymond;{tgs}Without Simon and his allies, Raymond had little hope of killing Lachesis and freeing himself from her curse. Though he spent the rest of his life trying, he was killed in an unfortunate accident only a few years after Morrissey's defeat.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"LadyJane\") and game.get_unit(\"LadyJane\").team == 'player'",
            "ending;LadyJane;Lady Jane;{tgs}Jane seized the chaos of Simon's departure, and took control of a few villages to the southwest of Castle Verstadt. Yet, despite her power, the people prevailed, and slew her within a few months. Though some of her subjects lived on, the sorceress herself was quickly forgotten.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "credits;Maps By;SP,KD,Rammerrush;wait;center",
            "wait;6000",
            "",
            "if;game.check_alive(\"Lupus\") and game.get_unit(\"Lupus\").team == 'player'",
            "ending;Lupus;Lupus;{tgs}Declining Simon's offer to join him, Lupus split, preferring to leave that part of his life behind. There are no official accounts of his work after the defeat of Morrissey, though it's certain that he emptied more than a few storehouses.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Lim\")",
            "ending;Lim;Lim;{tgs}Lim and Nika returned to Frees, and were happily married within a few years. Their combined magical skill, once thought by both of them to be a cruel curse, ultimately protected Frees against the revolutions that swept the continent.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Titus\") and game.get_unit(\"Titus\").team == 'player'",
            "ending;Titus;Titus;{tgs}Titus decided to travel with Simon, reestablishing the Wandering Knights in their strange new continent. Despite the change in location, he found many souls with the heroic spirit that had inspired his previous battalion, and vanquished evil wherever he found it.",
            "wait;9000",
            "pop_dialog",
            "end",
            "",
            "credits;Playtesting By;HeroicVileplume,EthanGreen,Lord Tweed,Sherlorca,Roltair;wait;center",
            "wait;6000",
            "",
            "wait;5000",
            "",
            "speak_style;IntroQuote;Narrator;center;190;4.0;White;chapter-white;None;5;f;None;0.0;None",
            "speak;Narrator;It is a naive thing to value justice over order. For those who do have never experienced the injustice of disorder.;StyleNid=IntroQuote;no_block;hold;no_sound",
            "wait;10000",
            "unhold;IntroQuote",
            "",
            "speak;Narrator;So wove Clotho, sister of the Fates.;StyleNid=IntroQuote;no_block;hold;no_sound",
            "music_clear;6000",
            "wait;7000",
            "unhold;IntroQuote",
            "",
            "wait;4000",
            "main_menu"
        ]
    }
]