[
    {
        "name": "DefiedEnding",
        "trigger": null,
        "level_nid": "49",
        "condition": "True",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "music;WindsweptDay;1000",
            "",
            "change_background;BlackBackground",
            "wait;2000",
            "credits;A Game By;SP,KD;wait;center",
            "wait;6000",
            "",
            "ending;Simon;Simon;{tgs}Simon was crowned as king later that year. He spent a decade touring the realm, negotiating a peace where he could and enforcing it where he could not. To many historians, Simon Verstadt became the model of a wise monarch. His reign ended with the continent experiencing hitherto unseen prosperity and trade.",
            "wait;10000",
            "pop_dialog",
            "",
            "ending;Anuki;Anuki;{tgs}Anuki was crowned queen and immediately set about restoring House Morrissey's fortunes. Ironically, though she hated children, she spent considerable resources building schools across Morrissey and Verstadt land. ",
            "wait;10000",
            "pop_dialog",
            "",
            "credits;Engine By;rainlash,mag,KD,aorlnn;wait;center",
            "wait;6000",
            "",
            "ending;Luther;Luther;{tgs}Offered the position of Knight-Captain by Simon, Luther, for the first time in his life, refused his lord. He lived out the rest of his life peacefully in Verstadt land, watching the seeds he had sown bloom into the most beautiful of flowers.",
            "wait;8000",
            "pop_dialog",
            "",
            "paired_ending;Juliet;Vincent;Juliet;Vincent;{tgs}After the war ended, Vincent and Juliet served lifelong careers in the king's service. Vincent proposed to Juliet, and the two were wed in a royal ceremony within Castle Verstadt.",
            "wait;8000",
            "pop_dialog",
            "",
            "credits;World Map By;BT;wait;center",
            "wait;6000",
            "",
            "if;game.check_alive(\"Boudica\")",
            "ending;Boudica;Boudica;{tgs}Boudica was granted a sizable donation of money and resources to help rebuild her village. Refugees from across the realm flocked to it, and it soon became a haven for those forced to flee violence. Boudica's legend was passed down to the village's youth, inspiring many to follow in her footsteps.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Kajal\") and game.get_unit(\"Kajal\").team == 'player'",
            "ending;Kajal;Kajal;{tgs}Kajal returned to Vesner's ruined lands, intending to live a life of exile. Yet, any who began to live near those swamps noticed something: those who came in peace rarely encountered even a zombie, while bandits and raiders met endless resistance from hordes of monsters.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Mitzi\")",
            "ending;Mitzi;Mitzi;{tgs}Mitzi's treatises became the defining history of the beginning of the Verstadt era. Though many of her methods were not remembered fondly by future historians, her work became a cornerstone of classics education.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Nika\")",
            "ending;Nika;Nika;{tgs}With peace restored, Nika returned to her village. She confided later that Frees never truly felt the same to her. Living without fear of raids was too alien a life. But peace had a charm to it, and she treasured that charm throughout her long life.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Lim\")",
            "ending;Lim;Lim;{tgs}Lim and Nika returned to Frees, and were happily married within a few years. Lim took after her mother and began a farm, though she and Nika noted that many of her crops grew strange mutations. After some study, those crops formed the basis of a new field of research: anti-infection medicine.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "credits;Tilesets By;Feaw,N426,ZoramineFae,Venno,Lexou,Amras Anarion,Thunungu,aveontrainer,Inkaline, Redshrike,dracoyan,magiscarf;wait;center",
            "wait;4000",
            "",
            "if;game.check_alive(\"Flower\")",
            "ending;Flower;Flower;{tgs}After returning to Frees, Flower lived a long and happy life with her owners. History has little to say about her, though many trace the abundance of puppies in Frees to her legacy.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "ending;MaYuan;Ma Yuan;{tgs}Ma Yuan ceased to function soon after the Fates were defeated. Brought to Pelopos some time after the coronation, research at the Mage's School led to major breakthroughs in engineering.",
            "wait;8000",
            "pop_dialog",
            "",
            "if;game.check_alive(\"Twins\") and game.get_unit(\"Twins\").team == 'player'",
            "ending;Twins;The Twins;{tgs}Aimless, the Twins journeyed around the continent, making friends with other misfits and renegades. After some tribulation, their band decided that they should do some good, and set to hunting down sorceresses like the ones that had cursed the Twins long ago.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Johannes\")",
            "ending;Johannes;Johannes;{tgs}Johannes took on the role of royal gamemaster shortly after the coronation. While in the past the position had been mostly ceremonial, he adapted it into one that more closely suited his interests. He set out, with Simon's blessing, to rid the realm of the most extravagant beasts he could find. By all accounts, no hunter has come close to matching him.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "credits;Item Icons By;Ironmachine,Topazlight,Beansy,Maxim,Lisandra Brave,Pikmin1211,WhydidImakethisaccount,Zelix,LordGlenn,Celice,Batima,Suneohair,FuriousHaunter,GabrielKnight;center",
            "wait;8000",
            "",
            "if;game.check_alive(\"Euclid\") and game.get_unit(\"Euclid\").team == 'player'",
            "ending;Euclid;Euclid;{tgs}Euclid was elected a senator of Pelopos soon after the defeat of the Fates. His bond with Simon allowed him to cement a lasting peace between Pelopos and the new Kingdom of Verstadt. Euclid shepherded a shared animosity of war through stark ideological divides, a task that cemented his place as a statesman.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Yusna\")",
            "ending;Yusna;Yusna;{tgs}Yusna returned to Port Hull after the coronation and oversaw its integration into Verstadt territory. Though it was resisted by some, the security Verstadt could provide, along with a generous helping of negotiations and bribes, helped secure Port Hull as a cornerstone of the kingdom's prosperity.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Lysander\") and game.get_unit(\"Lysander\").team == 'player'",
            "ending;Lysander;Lysander;{tgs}Unperturbed, Lysander returned to the arena at Pelopos. Though many traveling adventurers and warbands attempted to recruit him, he is said to have felt no reason to leave the city. The greatest opponents had already been conquered.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Map Sprites By;Suloir,Teraspark,Primefusion,ArcherBias,ZeroXA,Alusq,Epicer,N426,ShadowAllyX,Leif,MeatofJustice,Rasdel,ArcaneEli,Pikmin,L95,Der,Skitty,Devisian Nights,Fe7if,Boonzeet,Dei,Dondon151,Ririk,Catinator,Alexsplode,Dominus_Vobiscum,Snewping,Pushwall,Argo,Flasuban,ArcherBias,EldrichAbomination,knabepiercer,NightBloodTK,SALVAGED,BoneMan,Seth,VelvetKitsune,CanDy,Leo_link;center",
            "wait;10000",
            "",
            "if;game.check_alive(\"Alina\")",
            "ending;Alina;Alina;{tgs}Alina began a school of magic in Verstadt land, teaching traditional magic, dance, and song. Though initially ridiculed as inexperienced, over a few decades her school came to be more prestigious than the Peloponnesian school she had been disbarred from.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Melodie\") and game.get_unit(\"Melodie\").team == 'player'",
            "ending;Melodie;Melodie;{tgs}Impressed by Simon's tenacity and trustworthiness, Melodie acted as an envoy between her tribe and the new king. An agreement signed a few years after the coronation committed both groups to respecting the territorial claims of the other, and ensured a lasting peace for Melodie's tribe.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Hatshepsut\") and game.get_unit(\"Hatshepsut\").team == 'player'",
            "ending;Hatshepsut;Hatshepsut;{tgs}After many years of searching, Hatshepsut was able to finally find a place in Simon's new kingdom. Though she declined to serve in the royal guard, the small village she settled in appreciated her vigilant presence and protective nature.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Portraits By;Wasdye,amema003,CanDy,Armory,CapibaraInSpace,Eldritch Abomination,Freefall,Kanna,bwan,Obsidian Daddy,LaurentLacroix,Tom776,Zeldacrafter,Imperial,Its Just Jay,Levin64,XVI,Citrus,JiroPaiPai,Rammerrush,DATonDeman,Sterling Glover,SphealNuke,Salty,Sgt Dark,SirNicee,XPGamesNL,Ambrosiac,L95,Smokeguy77,RandomWizard,Yang Kai,Matthieu,XPGamesNL,Dutch Introvert,Alice;center",
            "wait;15000",
            "",
            "if;game.check_alive(\"Duygu\")",
            "ending;Duygu;Duygu;{tgs}Duygu became a steadfast knight of the new king following the coronation. Never afraid of a conflict, he charged headlong into any bandit-infested cavern he could find. With the support of allies, he always managed to emerge unscathed, living a long life in Simon's service.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Raymond\") and game.get_unit(\"Raymond\").team == 'player'",
            "ending;Raymond;Raymond;{tgs}With Lachesis killed, Raymond felt purposeless for the first time in many years. At Simon's request, he began to infiltrate criminal groups, both in high society and gangs, detailing their crimes and helping bring them to justice. Though his work was unappreciated by many, his work was instrumental in fostering stability.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"LadyJane\") and game.get_unit(\"LadyJane\").team == 'player'",
            "ending;LadyJane;Lady Jane;{tgs}Emboldened by foolishness, Jane attempted to begin her experiments anew. Quickly apprehended and imprisoned by Simon, she was forced to spend the rest of her days researching how to undo her curses.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "credits;Maps By;SP,KD,Rammerrush;wait;center",
            "wait;6000",
            "",
            "if;game.check_alive(\"Lupus\") and game.get_unit(\"Lupus\").team == 'player'",
            "ending;Lupus;Lupus;{tgs}Turned loose into the continent, Lupus specialized in retrieving the hidden and squandered riches of the old regimes. Though he is certain to have kept many of his finds for himself, the pieces that he shared with Simon formed the backbone of a healthy treasury.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Titus\") and game.get_unit(\"Titus\").team == 'player'",
            "ending;Titus;Titus;{tgs}At Titus's behest, the Wandering Knights were integrated into the Verstadt army as an elite strike regiment. After some years, however, he began to notice that evil had, indeed, been kept at bay. With Simon's permission he moved on to greener pastures, looking to vanquish corruption wherever it could be found.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "credits;Playtesting By;HeroicVileplume,EthanGreen,;wait;center",
            "wait;6000",
            "",
            "wait;5000",
            "",
            "speak_style;IntroQuote;Narrator;center;190;4.0;White;chapter-white;None;5;f;None;0.0;None",
            "speak;Narrator;And, in the end, I was happy to simply rest.;StyleNid=IntroQuote;no_block;hold;no_sound",
            "wait;7000",
            "unhold;IntroQuote",
            "",
            "speak;Narrator;So wrote Simon Verstadt, first King of Verstadt.;StyleNid=IntroQuote;no_block;hold;no_sound",
            "music_clear;6000",
            "wait;7000",
            "unhold;IntroQuote",
            "",
            "wait;4000",
            "main_menu"
        ]
    }
]