[
    {
        "name": "LachesisEnding",
        "trigger": null,
        "level_nid": "49",
        "condition": "True",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "music;SilverGarden",
            "change_background;BlackBackground",
            "wait;2000",
            "credits;A Game By;SP,KD;wait;center",
            "wait;6000",
            "",
            "ending;Simon;Simon;Under Jane's control, Verstadt land returned to how it had been under Simon's father. The people were mercilessly persecuted, and only a reborn New Dawn managed to finally overthrow him. Simon succumbed to illness without Jane's influence, and his body was hung from the castle gate, just as it had almost been all those years ago.",
            "wait;10000",
            "pop_dialog",
            "",
            "ending;LadyJane;Lady Jane;For a time, Jane had everything she could ever have wanted. Control. Subjects. Nearly unlimited magical power. But her tyranny pushed the people too far, and the New Dawn shattered her illusions of grandeur. There is, in the eyes of many, no greater villain in the history of the continent.",
            "wait;10000",
            "pop_dialog",
            "",
            "if;game.get_unit(\"Anuki\").team == \"player\"",
            "",
            "ending;Anuki;Anuki;Despondent, Anuki returned to Castle Morrissey and shut herself away from the world. The Hermit Duchess, as she came to be known, eventually dismissed her soldiers and lived alone within the castle. When bandits came to raid the ruins, she was nowhere to be found.",
            "wait;10000",
            "pop_dialog",
            "",
            "else",
            "",
            "ending;Anuki;Anuki;{tgs}Anuki's dynasty was buried with her. While her father's remaining advisors remembered her as loyal until the end, few remember her at all.",
            "wait;4000",
            "pop_dialog",
            "",
            "end",
            "",
            "credits;Engine By;rainlash,mag,KD,aorlnn;wait;center",
            "wait;6000",
            "",
            "ending;Luther;Luther;Recognizing Jane's sorcery, Luther attempted to cut the head off the snake and free Simon. But intercepted by her new puppet during his mission, Luther ultimately fell to his lord's blade.",
            "wait;8000",
            "pop_dialog",
            "",
            "paired_ending;Juliet;Vincent;Juliet;Vincent;With all other options exhausted, Vincent and Juliet defected to the reborn New Dawn. Though hated by many for their previous allegiance, their knowledge of warfare made them invaluable assets in the fight against Lady Jane.",
            "wait;8000",
            "pop_dialog",
            "",
            "credits;World Map By;BT;wait;center",
            "wait;6000",
            "",
            "if;game.check_alive(\"Boudica\")",
            "ending;Boudica;Boudica;Recognizing the implications of Jane's sorcery, Boudica returned to her village. Rebuilt and repopulated by refugees, the turmoil that swept the continent passed the tiny hamlet by.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Kajal\") and game.get_unit(\"Kajal\").team == 'player'",
            "ending;Kajal;Kajal;Leaving Simon's retinue, Kajal sought to build a magocracy in the ruins of Vesner's land. Though few survived the journey to his new lands, rumors of his power began to amass a dark cult of followers, many of whom had once flocked to Jane's cause.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Mitzi\")",
            "ending;Mitzi;Mitzi;Concluding on a hopeless note, Mitzi ultimately never published the works she had written. Consigned to a forgotten role as a Pelopos court scribe, history never had the chance to remember the one who had been so desperate to write of it.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Nika\")",
            "ending;Nika;Nika;Seeing Jane's scheme come to fruition broke Nika's spirit. She was found to be missing from the barracks one morning, and the search parties could turn up nothing. She never returned to Frees, nor to any of the places she had visited in the realm.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Tilesets By;Feaw,N426,ZoramineFae,Venno,Lexou,Amras Anarion,Thunungu,aveontrainer,Inkaline, Redshrike,dracoyan,magiscarf;wait;center",
            "wait;4000",
            "",
            "if;game.check_alive(\"Flower\")",
            "ending;Flower;Flower;Abandoned and confused, Flower attempted to make her way back to Frees village. After wandering away from Castle Verstadt, she was never seen again.",
            "wait;6000",
            "pop_dialog",
            "end",
            "",
            "ending;MaYuan;Ma Yuan;Ma Yuan ceased to function soon after Morrissey's betrayal. Though attempts were made to study its inner workings, the rebellions made serious research impossible. It was, alongside the ruins it flew from, eventually consigned to dust.",
            "wait;10000",
            "pop_dialog",
            "",
            "if;game.check_alive(\"Twins\") and game.get_unit(\"Twins\").team == 'player'",
            "ending;Twins;The Twins;The Twins again fell under the Sorceress's control after the end of the war. Their strength made them an important puppet of Jane's, and they were one of her final minions to fall to the rebels.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Johannes\")",
            "ending;Johannes;Johannes;The fall of House Verstadt affected Johannes little. He continued on his way, slaying whatever beasts he could find to challenge him. History lost track of him soon afterwards, and there are no further accounts of his travels.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Item Icons By;Ironmachine,Topazlight,Beansy,Maxim,Lisandra Brave,Pikmin1211,WhydidImakethisaccount,Zelix,LordGlenn,Celice,Batima,Suneohair,FuriousHaunter,GabrielKnight,NeoMasterZX,ZeroXA;center",
            "wait;8000",
            "",
            "if;game.check_alive(\"Euclid\") and game.get_unit(\"Euclid\").team == 'player'",
            "ending;Euclid;Euclid;Sensing an opportunity to spread civilization, Euclid was commissioned by the Pelopos senate to seize a portion of Morrissey's land. This military victory earned him a senate seat, though he rarely seemed interested in his work.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Yusna\")",
            "ending;Yusna;Yusna;Hoping to find an end to the chaos, Yusna returned to Port Hull. But the instability spread throughout the continent ruined the trade economy of the once-prosperous city. It became a ghost town, and Yusna was left to wander within the sea of refugees spread throughout the continent.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Lysander\") and game.get_unit(\"Lysander\").team == 'player'",
            "ending;Lysander;Lysander;As the persecution of the people in Verstadt land increased, Lysander began to shepard columns of refugees away from Jane's grasp. Though an immensely dangerous task, he never shied away from the impossible.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Map Sprites By;Suloir,Teraspark,Primefusion,ArcherBias,ZeroXA,Alusq,Epicer,N426,ShadowAllyX,Leif,MeatofJustice,Rasdel,ArcaneEli,Pikmin,L95,Der,Skitty,Devisian Nights,Fe7if,Boonzeet,Dei,Dondon151,Ririk,Catinator,Alexsplode,Dominus_Vobiscum,Snewping,Pushwall,Argo,Flasuban,ArcherBias,EldrichAbomination,knabepiercer,NightBloodTK,SALVAGED,BoneMan,Seth,VelvetKitsune,CanDy,Leo_link;center",
            "wait;10000",
            "",
            "if;game.check_alive(\"Alina\")",
            "ending;Alina;Alina;Alina kept a low profile after Jane's coup, acting as a messenger and broker between various rebel factions. Though not from Verstadt lands, her tireless work was paramount to the rebirth of the New Dawn and formation of the rebel coalition.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Melodie\") and game.get_unit(\"Melodie\").team == 'player'",
            "ending;Melodie;Melodie;Having seen the chaos that she had expected of the civilized world, Melodie peacefully returned to her tribe. She was eventually made its chieftain, and expanded their hunting grounds into the territory of what had once been Verstadt and Port Hull.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Hatshepsut\") and game.get_unit(\"Hatshepsut\").team == 'player'",
            "ending;Hatshepsut;Hatshepsut;Initially reluctant to become embroiled in a conflict with another blessed, Hatshepsut eventually agreed to help the rebels against Jane. After the war ended, she left and moved west, struggling to find peace in a ruined land.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Portraits By;Wasdye,amema003,CanDy,Armory,CapibaraInSpace,Eldritch Abomination,Freefall,Kanna,bwan,Obsidian Daddy,LaurentLacroix,Tom776,Zeldacrafter,Imperial,Its Just Jay,Levin64,XVI,Citrus,JiroPaiPai,Rammerrush,DATonDeman,Sterling Glover,SphealNuke,Salty,Sgt Dark,SirNicee,XPGamesNL,Ambrosiac,L95,Smokeguy77,RandomWizard,Yang Kai,Matthieu,XPGamesNL,Dutch Introvert,Alice;center",
            "wait;15000",
            "",
            "if;game.check_alive(\"Duygu\")",
            "ending;Duygu;Duygu;Disappointed by Simon's failure, Duygu continued on his journey. He sought ever greater opponents, and was eventually said to have been killed in a landslide to the north of Troy. Only the earth itself could bury him.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Raymond\") and game.get_unit(\"Raymond\").team == 'player'",
            "ending;Raymond;Raymond;Recognizing Lachesis's handiwork, Raymond joined the rebel forces in their battle against Lady Jane. Instrumental in finding and opening a back entrance to Castle Verstadt, Raymond was unfortunately killed in the ensuing battle.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "credits;Maps By;SP,KD,Rammerrush;wait;center",
            "wait;6000",
            "",
            "if;game.check_alive(\"Lupus\") and game.get_unit(\"Lupus\").team == 'player'",
            "ending;Lupus;Lupus;Despite requests for assistance from the New Dawn, Lupus split, preferring to leave that part of his life behind. There are no official accounts of his work after the defeat of Morrissey, though some suggest he was soon found in a shallow grave.",
            "wait;8000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Lim\")",
            "ending;Lim;Lim;Lim tried in vain to follow Nika into her new journey. But after years of searching she eventually gave up, instead returning to Frees heartbroken and alone.",
            "wait;6000",
            "pop_dialog",
            "end",
            "",
            "if;game.check_alive(\"Titus\") and game.get_unit(\"Titus\").team == 'player'",
            "ending;Titus;Titus;Titus returned to the Wandering Knights and convinced them to join the battle against Lady Jane. A well-timed charge in the battle outside Castle Verstadt split Jane's minions, giving the rebels the crucial opening they needed. His heroic leadership is remembered even to this day.",
            "wait;10000",
            "pop_dialog",
            "end",
            "",
            "credits;Playtesting By;HeroicVileplume,EthanGreen,Lord Tweed,Sherlorca,Roltair;wait;center",
            "wait;6000",
            "",
            "wait;5000",
            "",
            "speak_style;IntroQuote;Narrator;center;190;4.0;White;chapter-white;None;5;f;None;0.0;None",
            "speak;Narrator;When tyranny is a fact, revolution becomes a right.;StyleNid=IntroQuote;no_block;hold;no_sound",
            "wait;7000",
            "unhold;IntroQuote",
            "",
            "speak;Narrator;So wove Lachesis, sister of the Fates.;StyleNid=IntroQuote;no_block;hold;no_sound",
            "music_clear;6000",
            "wait;7000",
            "unhold;IntroQuote",
            "",
            "wait;4000",
            "main_menu"
        ]
    }
]