[
    {
        "name": "Talk Morrissey 1",
        "trigger": "on_talk",
        "level_nid": "9",
        "condition": "unit2.nid==\"Morrissey\" and game.level_vars['NightPassed']!=1",
        "commands": [],
        "only_once": true,
        "priority": 20,
        "_source": [
            "move_unit;Simon;16,6",
            "multi_add_portrait;Simon;Left;Morrissey;Right",
            "speak;Morrissey;Ah, young Simon.{w}{br}I haven't seen you since you were a child, if my memory serves me.{w}{br}What brings you here?",
            "s;Simon;Lord Morrissey, I'm hoping to restore our houses' alliance.{w}{br}I know you were close with my father, but the uprisings and monsters....{w}{br}They made it hard to visit as often as I'd like after his passing.",
            "s;Morrissey;I see...{w}{br}Yes, with the so-called \"New Dawn's\" wanton destruction of the area,{w}{br}it makes sense that House Verstadt was preoccupied.{w}{br}I'm more than happy to rebuild our houses' relationship.{w}{br}But I must ask, why now?{w}{br}The monsters and rebels have only become more of an issue.{w}{br}I hate to pry, but something must have prompted you to come here.",
            "s;Simon;You're right, of course.{w}{br}Well, part of this is because I... {w}need your help.",
            "s;Simon;House Verstadt has fallen.",
            "s;Morrissey;Unthinkable...{w}{br}To what?",
            "s;Simon;Those \"New Dawn\" thugs. {w}They attacked us at night.{w}{br}Their forces are much stronger than we expected...",
            "s;Morrissey;I see...",
            "s;Simon;The noble houses are in danger, Lord Morrissey.{w}{br}Few houses remain, especially east of the capital.{w}{br}And with the route to the capital held by New Dawn, we're cut off from the rest of the region.",
            "s;Morrissey;I agree that this is quite dire.{w}{br}This is all quite a shame... the nobles' might has never been challenged to such a degree.",
            "s;Morrissey;I am open to negotiating on this.{w}{br}And I do not mean to sound unwilling to help,{w}{br}we must stand together in times like these, after all.{w}{br}Yet, I cannot afford to spare troops now, with the area in such disarray.",
            "s;Morrissey;But we'll speak more tomorrow. It grows late.{w}{br}You are welcome to stay here for the night.{w}{br}I will have my servants prepare chambers for you and your retainers.",
            "speak;Simon;... Thank you, sir.",
            "multi_remove_portrait;Simon;Morrissey",
            "remove_talk;Simon;Morrissey",
            "add_unit;109;22,15",
            "level_var;TalkMorrissey;1",
            "remove_talk;Simon;Vincent",
            "remove_talk;Simon;Juliet",
            "remove_talk;Simon;Brandt"
        ]
    }
]