[
    {
        "name": "MorrisseyTroops",
        "trigger": "on_talk",
        "level_nid": "MorrisseyCastleRoam",
        "condition": "unit2.nid=='Morrissey' and (v(\"DragonCleared\")==1 or v(\"SwampCleared\")==1) and v(\"MorrisseySupport\") != 1",
        "commands": [],
        "only_once": true,
        "priority": 20,
        "_source": [
            "multi_add_portrait;Simon;Left;Morrissey;Right",
            "",
            "# both objectives cleared",
            "if;v(\"DragonCleared\")==1 and v(\"SwampCleared\")==1",
            "    s;Simon;Lord Morrissey, we secured both the north and south.",
            "    s;Simon;We cleared the bandit hideout in the south and defeated the ancient dragon residing in the mountains.",
            "    s;Simon;We also traversed the swamp in Vesner's lands and dealt with the monster problem.",
            "    s;Simon;Order has been restored to the surrounding area.",
            "    s;Morrissey;Simon, you have exceeded every expectation.{w}{br}You and your group have done excellent work.",
            "    ",
            "# just dragon cleared",
            "elif;v(\"DragonCleared\")==1",
            "    s;Simon;Lord Morrissey, we restored order in the south.",
            "    s;Simon;We cleared the bandit hideout and defeated the ancient dragon residing in the mountains.",
            "    s;Morrissey;Well done, Simon. This is a significant victory.",
            "    s;Morrissey;Trade will be much easier without the threat of constant pillaging.",
            "    s;Morrissey;And to think a dragon dwelled within those mountains...",
            "    s;Morrissey;Its death is a substantial reassurance, considering the threat it could have posed to us.",
            "",
            "# just swamp cleared",
            "else",
            "    s;Simon;Lord Morrissey, we restored order in the north.",
            "    s;Simon;We traversed the swamp in Vesner's lands and dealt with the monster problem.",
            "    s;Morrissey;Well done, Simon. This is a significant victory.",
            "    s;Morrissey;The surrounding lands will be much safer without the constant threat of monsters.",
            "    s;Morrissey;House Morrissey can also look toward expanding into the region.",
            "    s;Morrissey;Yet, that is a problem for another day.",
            "",
            "end",
            "s;Morrissey;With your hard work, I can finally devote my forces to other aims.{w}{br}Namely, helping you retake Castle Verstadt.|When you're ready, join me on the outskirts of your manor.|My men will await you there to begin the siege.",
            "multi_remove_portrait;Simon;Morrissey",
            "game_var;MorrisseySupport;1",
            "remove_talk;Simon;Morrissey"
        ]
    }
]